app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT `products`.* FROM `products` ORDER BY average_rating

  def edit
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`average_rating`, `created_at`, `model_number`, `name`, `updated_at`) VALUES (NULL, '2012-08-07 07:42:28', 12, 'Super Axe', '2012-08-07 07:42:28')

  def update
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 7 LIMIT 1

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 12 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 12