app/controllers/reviews_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def index
    @product = Product.find(params[:product_id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`comment`, `created_at`, `product_id`, `rating`, `status`, `updated_at`, `user_email`, `user_id`) VALUES ('hvugckyfrcitfrxctfj', '2012-08-06 03:44:48', NULL, 4, 'active', '2012-08-06 03:44:48', 'zombie@reviews.com', 1)
---
  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.build(params[:review].merge(:user_id => current_user.id))
    @review.comment = @review.strip_comment

    respond_to do |format|
      if @review.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1 AND `reviews`.`id` = 11 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 10
---
  def destroy
    @product = Product.find(params[:product_id])
    @review = @product.reviews.find(params[:id])
    @review.destroy