app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT `reviews`.* FROM `reviews`

  def show
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1

  def edit
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 5 LIMIT 1

  def update
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 7 LIMIT 1