app/views/reviews/index.html.erb


<% @product.active_reviews.each do |review| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1